podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Device.SVD/Internal/peripherals/SDHC_MK28F15.svd.xml
            <register>
               <name>IRQSTATEN</name>
               <description>Interrupt Status Enable register</description>
               <addressOffset>0x34</addressOffset>
               <resetValue>0x117F013F</resetValue>
               <fields>
                  <field>
                     <name>CCSEN</name>
                     <description>Command Complete Status Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Masked</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Enabled</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field derivedFrom="CCSEN" > <name>TCSEN</name> <description>Transfer Complete Status Enable</description> <bitOffset>1</bitOffset> </field>
                  <field derivedFrom="CCSEN" > <name>BGESEN</name> <description>Block Gap Event Status Enable</description> <bitOffset>2</bitOffset> </field>
                  <field derivedFrom="CCSEN" > <name>DINTSEN</name> <description>DMA Interrupt Status Enable</description> <bitOffset>3</bitOffset> </field>
                  <field derivedFrom="CCSEN" > <name>BWRSEN</name> <description>Buffer Write Ready Status Enable</description> <bitOffset>4</bitOffset> </field>
                  <field derivedFrom="CCSEN" > <name>BRRSEN</name> <description>Buffer Read Ready Status Enable</description> <bitOffset>5</bitOffset> </field>
                  <field derivedFrom="CCSEN" > <name>CINSEN</name> <description>Card Insertion Status Enable</description> <bitOffset>6</bitOffset> </field>
                  <field derivedFrom="CCSEN" > <name>CRMSEN</name> <description>Card Removal Status Enable</description> <bitOffset>7</bitOffset> </field>
                  <field derivedFrom="CCSEN" > <name>CINTSEN</name> <description>Card Interrupt Status Enable</description> <bitOffset>8</bitOffset> </field>
                  <field derivedFrom="CCSEN" > <name>CTOESEN</name> <description>Command Timeout Error Status Enable</description> <bitOffset>16</bitOffset> </field>
                  <field derivedFrom="CCSEN" > <name>CCESEN</name> <description>Command CRC Error Status Enable</description> <bitOffset>17</bitOffset> </field>
                  <field derivedFrom="CCSEN" > <name>CEBESEN</name> <description>Command End Bit Error Status Enable</description> <bitOffset>18</bitOffset> </field>
                  <field derivedFrom="CCSEN" > <name>CIESEN</name> <description>Command Index Error Status Enable</description> <bitOffset>19</bitOffset> </field>
                  <field derivedFrom="CCSEN" > <name>DTOESEN</name> <description>Data Timeout Error Status Enable</description> <bitOffset>20</bitOffset> </field>
                  <field derivedFrom="CCSEN" > <name>DCESEN</name> <description>Data CRC Error Status Enable</description> <bitOffset>21</bitOffset> </field>
                  <field derivedFrom="CCSEN" > <name>DEBESEN</name> <description>Data End Bit Error Status Enable</description> <bitOffset>22</bitOffset> </field>
                  <field derivedFrom="CCSEN" > <name>AC12ESEN</name> <description>Auto CMD12 Error Status Enable</description> <bitOffset>24</bitOffset> </field>
                  <field derivedFrom="CCSEN" > <name>DMAESEN</name> <description>DMA Error Status Enable</description> <bitOffset>28</bitOffset> </field>
               </fields>
            </register>
            <register>
               <name>IRQSIGEN</name>
               <description>Interrupt Signal Enable register</description>
               <addressOffset>0x38</addressOffset>
               <fields>
                  <field>
                     <name>CCIEN</name>
                     <description>Command Complete Interrupt Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Masked</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Enabled</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field derivedFrom="CCIEN" > <name>TCIEN</name> <description>Transfer Complete Interrupt Enable</description> <bitOffset>1</bitOffset> </field>
                  <field derivedFrom="CCIEN" > <name>BGEIEN</name> <description>Block Gap Event Interrupt Enable</description> <bitOffset>2</bitOffset> </field>
                  <field derivedFrom="CCIEN" > <name>DINTIEN</name> <description>DMA Interrupt Enable</description> <bitOffset>3</bitOffset> </field>
                  <field derivedFrom="CCIEN" > <name>BWRIEN</name> <description>Buffer Write Ready Interrupt Enable</description> <bitOffset>4</bitOffset> </field>
                  <field derivedFrom="CCIEN" > <name>BRRIEN</name> <description>Buffer Read Ready Interrupt Enable</description> <bitOffset>5</bitOffset> </field>
                  <field derivedFrom="CCIEN" > <name>CINSIEN</name> <description>Card Insertion Interrupt Enable</description> <bitOffset>6</bitOffset> </field>
                  <field derivedFrom="CCIEN" > <name>CRMIEN</name> <description>Card Removal Interrupt Enable</description> <bitOffset>7</bitOffset> </field>
                  <field derivedFrom="CCIEN" > <name>CINTIEN</name> <description>Card Interrupt Enable</description> <bitOffset>8</bitOffset> </field>
                  <field derivedFrom="CCIEN" > <name>CTOEIEN</name> <description>Command Timeout Error Interrupt Enable</description> <bitOffset>16</bitOffset> </field>
                  <field derivedFrom="CCIEN" > <name>CCEIEN</name> <description>Command CRC Error Interrupt Enable</description> <bitOffset>17</bitOffset> </field>
                  <field derivedFrom="CCIEN" > <name>CEBEIEN</name> <description>Command End Bit Error Interrupt Enable</description> <bitOffset>18</bitOffset> </field>
                  <field derivedFrom="CCIEN" > <name>CIEIEN</name> <description>Command Index Error Interrupt Enable</description> <bitOffset>19</bitOffset> </field>
                  <field derivedFrom="CCIEN" > <name>DTOEIEN</name> <description>Data Timeout Error Interrupt Enable</description> <bitOffset>20</bitOffset> </field>
                  <field derivedFrom="CCIEN" > <name>DCEIEN</name> <description>Data CRC Error Interrupt Enable</description> <bitOffset>21</bitOffset> </field>
                  <field derivedFrom="CCIEN" > <name>DEBEIEN</name> <description>Data End Bit Error Interrupt Enable</description> <bitOffset>22</bitOffset> </field>
                  <field derivedFrom="CCIEN" > <name>AC12EIEN</name> <description>Auto CMD12 Error Interrupt Enable</description> <bitOffset>24</bitOffset> </field>
                  <field derivedFrom="CCIEN" > <name>DMAEIEN</name> <description>DMA Error Interrupt Enable</description> <bitOffset>28</bitOffset> </field>
               </fields>
            </register>
            <register>
               <name>AC12ERR</name>
               <description>Auto CMD12 Error Status Register</description>
               <addressOffset>0x3C</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>AC12NE</name>
                     <description>Auto CMD12 Not Executed</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Executed</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Not executed</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>AC12TOE</name>
                     <description>Auto CMD12 Timeout Error</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>No error</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Time out</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>AC12EBE</name>
                     <description>Auto CMD12 End Bit Error</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>No error</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>End bit error generated</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>AC12CE</name>
                     <description>Auto CMD12 CRC Error</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>No CRC error</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>CRC error met in Auto CMD12 response</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>AC12IE</name>
                     <description>Auto CMD12 Index Error</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>No error</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Error, the CMD index in response is not CMD12</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CNIBAC12E</name>
                     <description>Command Not Issued By Auto CMD12 Error</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>No error</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Not issued</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>HTCAPBLT</name>
               <description>Host Controller Capabilities</description>
               <addressOffset>0x40</addressOffset>
               <access>read-only</access>
               <resetValue>0x7F30000</resetValue>
               <fields>
                  <field>
                     <name>MBL</name>
                     <description>Max Block Length</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b000</name>
                           <description>512 bytes</description>
                           <value>0b000</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b001</name>
                           <description>1024 bytes</description>
                           <value>0b001</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b010</name>
                           <description>2048 bytes</description>
                           <value>0b010</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b011</name>
                           <description>4096 bytes</description>
                           <value>0b011</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ADMAS</name>
                     <description>ADMA Support</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Advanced DMA not supported</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Advanced DMA supported</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>HSS</name>
                     <description>High Speed Support</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>High speed not supported</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>High speed supported</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DMAS</name>
                     <description>DMA Support</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>DMA not supported</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>DMA supported</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SRS</name>
                     <description>Suspend/Resume Support</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Not supported</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Supported</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>VS33</name>
                     <description>Voltage Support 3.3 V</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>3.3 V not supported</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>3.3 V supported</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>WML</name>
               <description>Watermark Level Register</description>
               <addressOffset>0x44</addressOffset>
               <resetValue>0x100010</resetValue>
               <fields>
                  <field>
                     <name>RDWML</name>
                     <description>Read Watermark Level</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>WRWML</name>
                     <description>Write Watermark Level</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
